GreatCowBASIC/DATFileGenerator/incfiles/p18F44Q71.inc
;----- PORTWIN7 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'


;----- PORTWDF Bits -----------------------------------------------------
DF0              EQU  H'0000'
DF1              EQU  H'0001'
DF2              EQU  H'0002'
DF3              EQU  H'0003'
DF4              EQU  H'0004'
DF5              EQU  H'0005'
DF6              EQU  H'0006'
DF7              EQU  H'0007'
PWDF0            EQU  H'0000'
PWDF1            EQU  H'0001'
PWDF2            EQU  H'0002'
PWDF3            EQU  H'0003'
PWDF4            EQU  H'0004'
PWDF5            EQU  H'0005'
PWDF6            EQU  H'0006'
PWDF7            EQU  H'0007'


;----- PORTWCON Bits -----------------------------------------------------
CLKEN            EQU  H'0000'


;----- ADCGA Bits -----------------------------------------------------
CGA0             EQU  H'0000'
CGA1             EQU  H'0001'
CGA2             EQU  H'0002'
CGA3             EQU  H'0003'
CGA4             EQU  H'0004'
CGA5             EQU  H'0005'
CGA6             EQU  H'0006'
CGA7             EQU  H'0007'
ADCGA0           EQU  H'0000'
ADCGA1           EQU  H'0001'
ADCGA2           EQU  H'0002'
ADCGA3           EQU  H'0003'
ADCGA4           EQU  H'0004'
ADCGA5           EQU  H'0005'
ADCGA6           EQU  H'0006'
ADCGA7           EQU  H'0007'


;----- ADCGB Bits -----------------------------------------------------
CGB0             EQU  H'0000'
CGB1             EQU  H'0001'
CGB2             EQU  H'0002'
CGB3             EQU  H'0003'
CGB4             EQU  H'0004'
CGB5             EQU  H'0005'
CGB6             EQU  H'0006'
CGB7             EQU  H'0007'
ADCGB0           EQU  H'0000'
ADCGB1           EQU  H'0001'
ADCGB2           EQU  H'0002'
ADCGB3           EQU  H'0003'
ADCGB4           EQU  H'0004'
ADCGB5           EQU  H'0005'
ADCGB6           EQU  H'0006'
ADCGB7           EQU  H'0007'


;----- ADCGC Bits -----------------------------------------------------
CGC0             EQU  H'0000'
CGC1             EQU  H'0001'
CGC2             EQU  H'0002'
CGC3             EQU  H'0003'
CGC4             EQU  H'0004'
CGC5             EQU  H'0005'
CGC6             EQU  H'0006'
CGC7             EQU  H'0007'
ADCGC0           EQU  H'0000'
ADCGC1           EQU  H'0001'
ADCGC2           EQU  H'0002'
ADCGC3           EQU  H'0003'
ADCGC4           EQU  H'0004'
ADCGC5           EQU  H'0005'
ADCGC6           EQU  H'0006'
ADCGC7           EQU  H'0007'


;----- ADCGD Bits -----------------------------------------------------
CGD0             EQU  H'0000'
CGD1             EQU  H'0001'
CGD2             EQU  H'0002'
CGD3             EQU  H'0003'
CGD4             EQU  H'0004'
CGD5             EQU  H'0005'
CGD6             EQU  H'0006'
CGD7             EQU  H'0007'
ADCGD0           EQU  H'0000'
ADCGD1           EQU  H'0001'
ADCGD2           EQU  H'0002'
ADCGD3           EQU  H'0003'
ADCGD4           EQU  H'0004'
ADCGD5           EQU  H'0005'
ADCGD6           EQU  H'0006'
ADCGD7           EQU  H'0007'


;----- ADCGE Bits -----------------------------------------------------
CGE0             EQU  H'0000'
CGE1             EQU  H'0001'
CGE2             EQU  H'0002'
ADCGE0           EQU  H'0000'
ADCGE1           EQU  H'0001'
ADCGE2           EQU  H'0002'


;----- OPA2CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
CPON_OPA2CON0    EQU  H'0005'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA2UG           EQU  H'0003'
OPA2CPON         EQU  H'0005'
OPA2EN           EQU  H'0007'


;----- OPA2CON1 Bits -----------------------------------------------------
RESON            EQU  H'0003'
NSS0             EQU  H'0000'
NSS1             EQU  H'0001'
NSS2             EQU  H'0002'
GSEL0            EQU  H'0004'
GSEL1            EQU  H'0005'
GSEL2            EQU  H'0006'
OPA2RESON        EQU  H'0003'
OPA2NSS0         EQU  H'0000'
OPA2NSS1         EQU  H'0001'
OPA2NSS2         EQU  H'0002'
OPA2GSEL0        EQU  H'0004'
OPA2GSEL1        EQU  H'0005'
OPA2GSEL2        EQU  H'0006'


;----- OPA2CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
NCH0_OPA2CON2    EQU  H'0004'
NCH1_OPA2CON2    EQU  H'0005'
NCH2_OPA2CON2    EQU  H'0006'
OPA2PCH0         EQU  H'0000'
OPA2PCH1         EQU  H'0001'
OPA2PCH2         EQU  H'0002'
OPA2NCH0         EQU  H'0004'
OPA2NCH1         EQU  H'0005'
OPA2NCH2         EQU  H'0006'


;----- OPA2CON3 Bits -----------------------------------------------------
INTOE            EQU  H'0005'
PSS0_OPA2CON3    EQU  H'0000'
PSS1_OPA2CON3    EQU  H'0001'
PSS2             EQU  H'0002'
PSS3             EQU  H'0003'
PSS4             EQU  H'0004'
FMS0             EQU  H'0006'
FMS1             EQU  H'0007'
OPA2INTOE        EQU  H'0005'
OPA2PSS0         EQU  H'0000'
OPA2PSS1         EQU  H'0001'
OPA2PSS2         EQU  H'0002'
OPA2PSS3         EQU  H'0003'
OPA2PSS4         EQU  H'0004'
OPA2FMS0         EQU  H'0006'
OPA2FMS1         EQU  H'0007'


;----- OPA2CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
PTRES            EQU  H'0004'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA2OFCST        EQU  H'0002'
OPA2PTRES        EQU  H'0004'
OPA2OFCSEL0      EQU  H'0000'
OPA2OFCSEL1      EQU  H'0001'


;----- OPA2HWC Bits -----------------------------------------------------
ORPOL            EQU  H'0003'
OREN             EQU  H'0007'
HWCL0            EQU  H'0000'
HWCL1            EQU  H'0001'
HWCL2            EQU  H'0002'
HWCH0            EQU  H'0004'
HWCH1            EQU  H'0005'
HWCH2            EQU  H'0006'
OPA2ORPOL        EQU  H'0003'
OPA2OREN         EQU  H'0007'
OPA2HWCL0        EQU  H'0000'
OPA2HWCL1        EQU  H'0001'
OPA2HWCL2        EQU  H'0002'
OPA2HWCH0        EQU  H'0004'
OPA2HWCH1        EQU  H'0005'
OPA2HWCH2        EQU  H'0006'


